In [210]:
import pandas as pd

In [211]:
import seaborn as sns

In [212]:
import sklearn

In [213]:
df=pd.read_csv(r"C:\Users\mdimr\Downloads\groupbyExcercise - groupbyExcercise.csv")
df

    Unnamed: 0        Date Product  Revenue  Quantity
0            0  2023-01-01       A      221         3
1            1  2023-01-01       B      111         8
2            2  2023-01-02       B      171        11
3            3  2023-01-02       A      141        15
4            4  2023-02-01       A       75         4
5            5  2023-02-01       B       90        12
6            6  2023-02-02       A       96        17
7            7  2023-02-02       B      170        10
8            8  2023-03-01       B      200        19
9            9  2023-03-01       A      120        10
10          10  2023-03-02       A      121        12
11          11  2023-03-02       B      150         5

In [214]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  12 non-null     int64
 1   Date        12 non-null     object
 2   Product     12 non-null     object
 3   Revenue     12 non-null     int64
 4   Quantity    12 non-null     int64
dtypes: int64(3), object(2)
memory usage: 612.0+ bytes

In [215]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [216]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      12 non-null     object
 1   Product   12 non-null     object
 2   Revenue   12 non-null     int64
 3   Quantity  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [217]:
df.describe()

          Revenue  Quantity
count   12.000000     12.00
mean   138.833333     10.50
std     45.095522      5.00
min     75.000000      3.00
25%    107.250000      7.25
50%    131.000000     10.50
75%    170.250000     12.75
max    221.000000     19.00

In [218]:
df.describe().T

          count        mean        std   min     25%    50%     75%    max
Revenue    12.0  138.833333  45.095522  75.0  107.25  131.0  170.25  221.0
Quantity   12.0   10.500000   5.000000   3.0    7.25   10.5   12.75   19.0

## 1. Arrange DataFrame df, focusing on distinct product categories. Explore the data           to reveal:
   * Overall revenue insights
   * Average revenue patterns
   * Peak quantity sold observations
   * Minimum quantity sold occurrences

### (i)  Overall revenue insights

In [219]:
df.groupby(['Product'])['Revenue'].sum()

Product
A    774
B    892
Name: Revenue, dtype: int64

### (ii) Average revenue patterns

In [220]:
df.groupby(['Product'])['Revenue'].mean()

Product
A    129.000000
B    148.666667
Name: Revenue, dtype: float64

### (iii) Peak quantity sold observations

In [98]:
df.groupby(['Product'])['Quantity'].max()

Product
A    17
B    19
Name: Quantity, dtype: int64

### (iv) Minimum quantity sold occurrences

In [99]:
df.groupby(['Product'])['Quantity'].min()

Product
A    3
B    5
Name: Quantity, dtype: int64

## 2.  Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [254]:
df['Date'] = pd.to_datetime(df['Date'])
df['Month'] = df['Date'].dt.month
df['Year'] = df['Date'].dt.year
df[['Date','Month','Year']]

         Date  Month  Year
0  2023-01-01      1  2023
1  2023-01-01      1  2023
2  2023-01-02      1  2023
3  2023-01-02      1  2023
4  2023-02-01      2  2023
5  2023-02-01      2  2023
6  2023-02-02      2  2023
7  2023-02-02      2  2023
8  2023-03-01      3  2023
9  2023-03-01      3  2023
10 2023-03-02      3  2023
11 2023-03-02      3  2023

In [255]:
x = df.groupby(['Month', 'Year'])['Revenue'].sum()
print(x)

Month  Year
1      2023    644
2      2023    431
3      2023    591
Name: Revenue, dtype: int64

## 3. Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [256]:
x = df.groupby(['Date'])[['Revenue','Quantity']].sum()
x

            Revenue  Quantity
Date
2023-01-01      332        11
2023-01-02      312        26
2023-02-01      165        16
2023-02-02      266        27
2023-03-01      320        29
2023-03-02      271        17

In [257]:
max_revenue_date =x['Revenue'].idxmax()
max_revenue_date
print('Date with Highest revenue  is : ', max_revenue_date)

Date with Highest revenue  is :  2023-01-01 00:00:00

In [239]:
max_quantity_date = x['Quantity'].idxmax()
print('Date with Highest quantity sold is : ', max_quantity_date)

Date with Highest quantity sold is :  2023-03-01

## 4. Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15 .

In [259]:
x = df.groupby(['Date', 'Product'])['Quantity'].sum()

In [260]:
y = x[(x > 10) & (x < 15)]

In [261]:
y

Date        Product
2023-01-02  B          11
2023-02-01  B          12
2023-03-02  A          12
Name: Quantity, dtype: int64

## 5. Group the DataFrame df by the 'Product' column andadd a new column 'Revenue Percentage' that shows the percentage of each product's revenue relative to the total revenue for that product.

In [161]:
x = df.groupby('Product')['Revenue'].sum()

In [162]:
percentage = x / x.sum() * 100

In [163]:
df['Revenue Percentage'] = df['Product'].map(percentage)
print(df)

          Date Product  Revenue  Quantity  Revenue Percentage
0   2023-01-01       A      221         3           46.458583
1   2023-01-01       B      111         8           53.541417
2   2023-01-02       B      171        11           53.541417
3   2023-01-02       A      141        15           46.458583
4   2023-02-01       A       75         4           46.458583
5   2023-02-01       B       90        12           53.541417
6   2023-02-02       A       96        17           46.458583
7   2023-02-02       B      170        10           53.541417
8   2023-03-01       B      200        19           53.541417
9   2023-03-01       A      120        10           46.458583
10  2023-03-02       A      121        12           46.458583
11  2023-03-02       B      150         5           53.541417